{
  "id": 11,
  "type": "work",
  "name": "Marketing Planning Management Tool",
  "heroImgUrl": "/7/hero.svg",
  "labels": [
    {
      "name": "Collaborative Design"
    },
    {
      "name": "Process Design"
    }
  ],
  "lead": "<p class='lead'>A return to Tag's software division as principle UX on a new product development initative.</p>",
  "sections": [
    {
      "sections": [
        {
          "type": "imageGrid",
          "heading": "Process Design",
          "content": "<p>I used collaborative design methods to reach a definition of what good looks like in the marketing planning process. This work was informed by customer understanding work I had peviously undertaken.</p><p>I later created BPMN versions of the post-it note processes. These diagrams also captured high level requirements for the customer journey and featured orchestration of reusable sub-processes.</p>",
          "images": [
            "/11/s1i1.jpeg",
            "/11/s1i2.png"
          ]
        },
        {
          "type": "imageGrid",
          "heading": "Personas and Use Case Mapping",
          "content": "<p>Utilising interviews, contextual inquiry, and surveys I had developed a good deal of understanding of the people, processes, and technology involved in marketing planning.</p><p>As part developing customer journey documentation I developed user group personas which I mapped to the use cases involved in the marketing planning process. This work also formed a basis of identity and permission management requirements.</p>",
          "images": [
            "/11/s2i1.png",
            "/11/s2i2.png",
            "/11/s2i3.png"
          ]
        },
        {
          "type": "imageGrid",
          "heading": "Sketches",
          "content": "<p>I made several hundred sketches based on the customer understanding and business requirements.</p>",
          "images": [
            "/11/s3i1.png",
            "/11/s3i2.png",
            "/11/s3i3.png"
          ]
        },
        {
          "type": "imageGrid",
          "heading": "Responsive Prototype",
          "content": "<p>To get a feel for the viability delivering the product as a responsive web application I created a responsive prototype of the primary screens the use cases would require.</p><p>I used Bootstrap and an implementation of Material Design to quickly develop a proof-of-concept HTML prototype.</p>",
          "images": [
            "/11/s4i1.png",
            "/11/s4i2.png",
            "/11/s4i3.png"
          ]
        }
      ]
    }
  ]
}
